{
  "source_title": "My sister (32 F) called CPS on my husband and I. Now that the case has been closed, I have no idea how to confront her.",
  "source_text": "My sister and I have always been close. Every year she spends Christmas Eve sleeping over with her fiance (M 31) and helps us get toys from Santa built and set up for Christmas Morning. We call ourselves Santa’s helpers, and have a lot of fun with it. This year, she spent the night, and saw my husband and father disciplining our son. (M 13) Our son is now a teenager and likes to ignore us when we ask him to do something, pretend he doesn’t know how to do something incredibly simple, slam doors, general teenager sassy behavior. His teachers at school notice it as well, so it’s something we’re working on at home. Our discipline style is somewhere between tough love, and “talk it out”. Every-time a conflict at home arises my son does the argue/flip out then “run upstairs and slam the door” thing, my husband will wait 10 minutes and go upstairs and have a heartfelt meaningful dialogue with him. This happened on Christmas Eve, he told his 3 year old sister Santa wasn’t real, and we both immediately told him that wasn’t okay, and he started arguing with us. It lead to the same typical back and fourth, the difference was, my sister and her fiance were present. Neither of them said anything and went about our usual Christmas Eve routine. Everything seemed fine, our son apologized and went to bed… Upon his return to school after break a CPS worker showed up and pulled him out of class to interview him, about how his parents treat him. He told them he loved his parents and that things at home were fine. He expressed that when we discipline him we sometimes ground him and we take away his electronics for a week, and sometimes he will argue with us, but he knows that when we discipline that we do it because we love him and want him to grow and learn. Now, a little detail about the month of December and its difficulties…I have a seizure disorder, I have not had a seizure in 10 years, and in the month of December out of nowhere I had 3 back to back to back. I was sitting at my neurologists office, preparing for an EEG sleep study, when I get a call that goes to voicemail from that same CPS worker saying the next day she would be coming to our house to interview us and our 3 year old…I immediately shared the number and voicemail to my husband and told him to call her back immediately because I couldn’t. So the very next day after an exhausting round of seizure tests, she came over. When she arrived the next day, we got a better picture of the accusations she made against us. 1.) she claimed my husband was an alcoholic with anger issues. 2.) she claimed we were starving our 3 children and had no food in the house. To answer the first accusation, it was Christmas Eve…ALL of our family was there, drinking egg nog or wine. NO ONE in the house got sloshed EXCEPT my sister who drank an entire 18 pack of beer to herself that night. We do not have a drinking problem, it was a holiday with family and a delicious meal I spent all day preparing. My husband does not have anger problems whatsoever. We WERE upset at what our son said to his sister, but not in any way that would justify saying anyone in this house has anger issues. My dad and my husband pulled our son aside to talk to him about it. I really Don’t understand this one. To answer accusation 2 as the CPS worker toured our house, we showed her our pantry, fridge and freezer. She literally laughed out loud and said “there’s enough food here to feed everyone in this house for 3 months.” We are absolutely NOT starving our kids AT ALL, and that was obvious right away. When the CPS worker was packing up to leave, she stated “I’m grateful to be handling a case in a functional home with happy healthy kids, usually it’s quite the opposite” Today, she called us back and is closing the case by the end of today. She does not believe any further action is needed and our risk score is low. Upon talking to my parents and brother, all agree this was for sure my sister based on talking with her themselves though she has not outright admitted it. All agree this was the last thing my family needed while dealing with my health issues, and restructuring our lives and schedules around the reality that I can’t drive for 6 months, so I can’t work. My husband and I see this as a MAJOR betrayal. I’m still reeling from the reality that a family member I’ve always been so close with and trusted would make such an impulsive, dishonest and quite frankly cruel decision like this. I have spent weeks trying to figure out how to confront her, as she has not fully admitted to doing this, but has heavily implied it to everyone who’s spoken to her…she went from being overly communicative the day of this interview, demanding I call her and tell her how it went, and in general blowing up my phone…to being silent, and not speaking to me for weeks after I told her it went fine. I believe she knows I assume she did this. I want to have a conversation with her, but I do not know how to do it. I feel betrayed by my sister, and incredibly hurt. I do not want to react emotionally, but I do want her to know this was WRONG."
}